In [31]:
import pandas as pd 
import numpy as np
import copy
import seaborn as sns
import matplotlib.pyplot as plt

### Zomato Dataset

In [32]:
zomato= pd.read_csv('/Users/vrunda/Library/CloudStorage/GoogleDrive-shahvrunda231296@gmail.com/.shortcut-targets-by-id/1If4Xq7JBYnZ3iRTOYUU8DDWlZlr7e5rJ/Dataset, Assignments, Interview Prep - D1/dataset/zomato.csv')

In [33]:
df= copy.deepcopy(zomato)

In [34]:
df.head()

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 17 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   url                          51717 non-null  object
 1   address                      51717 non-null  object
 2   name                         51717 non-null  object
 3   online_order                 51717 non-null  object
 4   book_table                   51717 non-null  object
 5   rate                         43942 non-null  object
 6   votes                        51717 non-null  int64
 7   phone                        50509 non-null  object
 8   location                     51696 non-null  object
 9   rest_type                    51490 non-null  object
 10  dish_liked                   23639 non-null  object
 11  cuisines                     51672 non-null  object
 12  approx_cost(for two people)  51371 non-null  object
 13  reviews_list                 51717 non-null  object
 14  menu_item                    51717 non-null  object
 15  listed_in(type)              51717 non-null  object
 16  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(16)
memory usage: 6.7+ MB

In [36]:
# We notice we have missing values lot of columns. All the columns data type is object, so we neeed to clean that.

In [37]:
# Lets remove unncessary columns, url, dish_liked, phone and menu_item

df.drop(columns=['url','phone','dish_liked', 'menu_item'], axis= 1, inplace=True)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   address                      51717 non-null  object
 1   name                         51717 non-null  object
 2   online_order                 51717 non-null  object
 3   book_table                   51717 non-null  object
 4   rate                         43942 non-null  object
 5   votes                        51717 non-null  int64
 6   location                     51696 non-null  object
 7   rest_type                    51490 non-null  object
 8   cuisines                     51672 non-null  object
 9   approx_cost(for two people)  51371 non-null  object
 10  reviews_list                 51717 non-null  object
 11  listed_in(type)              51717 non-null  object
 12  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(12)
memory usage: 5.1+ MB

In [39]:
# Check for duplicates .DS_Store
df.duplicated().sum()

np.int64(50)

In [40]:
# Drop duplicates 

df.drop_duplicates(inplace=True)

In [41]:
df.duplicated().sum()

np.int64(0)

In [42]:
# Check for null values 
df.isnull().sum()

address                           0
name                              0
online_order                      0
book_table                        0
rate                           7765
votes                             0
location                         21
rest_type                       227
cuisines                         45
approx_cost(for two people)     345
reviews_list                      0
listed_in(type)                   0
listed_in(city)                   0
dtype: int64

In [43]:
# We have 51717, we have missing 7765, we can drop it but not good practice. 
# We can fill na with mean, but rate is of string data type. 
# First lets conver the datatype 
df.rate 

df.rate.unique()

array(['4.1/5', '3.8/5', '3.7/5', '3.6/5', '4.6/5', '4.0/5', '4.2/5',
       '3.9/5', '3.1/5', '3.0/5', '3.2/5', '3.3/5', '2.8/5', '4.4/5',
       '4.3/5', 'NEW', '2.9/5', '3.5/5', nan, '2.6/5', '3.8 /5', '3.4/5',
       '4.5/5', '2.5/5', '2.7/5', '4.7/5', '2.4/5', '2.2/5', '2.3/5',
       '3.4 /5', '-', '3.6 /5', '4.8/5', '3.9 /5', '4.2 /5', '4.0 /5',
       '4.1 /5', '3.7 /5', '3.1 /5', '2.9 /5', '3.3 /5', '2.8 /5',
       '3.5 /5', '2.7 /5', '2.5 /5', '3.2 /5', '2.6 /5', '4.5 /5',
       '4.3 /5', '4.4 /5', '4.9/5', '2.1/5', '2.0/5', '1.8/5', '4.6 /5',
       '4.9 /5', '3.0 /5', '4.8 /5', '2.3 /5', '4.7 /5', '2.4 /5',
       '2.1 /5', '2.2 /5', '2.0 /5', '1.8 /5'], dtype=object)

In [44]:
# handle "new", then "-", remove /5 and space/5, then convert it to float, np.nan replace with mean. 

df['rate']= df['rate'].replace(['NEW','-'], np.nan)
df['rate'] = df['rate'].str.split('/').str[0].str.strip()

In [45]:
df['rate']= df['rate'].astype('float')
df['rate'].fillna(df.rate.mean(), inplace=True)

/var/folders/xw/_lnfz_x56cn_zn8_slshkwp80000gn/T/ipykernel_6515/2672325079.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['rate'].fillna(df.rate.mean(), inplace=True)

In [46]:
df.info() # rate data type has been changed and no more nulls.

<class 'pandas.core.frame.DataFrame'>
Index: 51667 entries, 0 to 51716
Data columns (total 13 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   address                      51667 non-null  object
 1   name                         51667 non-null  object
 2   online_order                 51667 non-null  object
 3   book_table                   51667 non-null  object
 4   rate                         51667 non-null  float64
 5   votes                        51667 non-null  int64
 6   location                     51646 non-null  object
 7   rest_type                    51440 non-null  object
 8   cuisines                     51622 non-null  object
 9   approx_cost(for two people)  51322 non-null  object
 10  reviews_list                 51667 non-null  object
 11  listed_in(type)              51667 non-null  object
 12  listed_in(city)              51667 non-null  object
dtypes: float64(1), int64(1), object(11)
memory usage: 5.5+ MB

In [47]:
# Sir's solution: 
"""
df= df.loc[df.rate != 'New' or df.rate!= '-'].reset_index(drop=True )
remove_slash= lambda x: x.replace('/5', "") if type(x)== str else x # here it wont throw error for np.nan.
df.rate= df['rate].apply(remove_slash).str.strip()
df['rate']= df['rate'].astype('float')
df['rate'].fillna(df.rate.mean(), inplace=True)
"""

'\ndf= df.loc[df.rate != \'New\' or df.rate!= \'-\'].reset_index(drop=True )\nremove_slash= lambda x: x.replace(\'/5\', "") if type(x)== str else x # here it wont throw error for np.nan.\ndf.rate= df[\'rate].apply(remove_slash).str.strip()\ndf[\'rate\']= df[\'rate\'].astype(\'float\')\ndf[\'rate\'].fillna(df.rate.mean(), inplace=True)\n'

In [48]:
# Change columns name to cost, listed

df.rename(columns= {
    'approx_cost(for two people)': 'cost',
    'listed_in(type)': 'type',
    'listed_in(city)': 'city'    
}, inplace=True)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 51667 entries, 0 to 51716
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   address       51667 non-null  object
 1   name          51667 non-null  object
 2   online_order  51667 non-null  object
 3   book_table    51667 non-null  object
 4   rate          51667 non-null  float64
 5   votes         51667 non-null  int64
 6   location      51646 non-null  object
 7   rest_type     51440 non-null  object
 8   cuisines      51622 non-null  object
 9   cost          51322 non-null  object
 10  reviews_list  51667 non-null  object
 11  type          51667 non-null  object
 12  city          51667 non-null  object
dtypes: float64(1), int64(1), object(11)
memory usage: 5.5+ MB

In [50]:
# Transforming cost column: 
df['cost']= df['cost'].str.replace(",", "")
df['cost']= df['cost'].astype(float)

In [51]:
df['cost']

0         800.0
1         800.0
2         800.0
3         300.0
4         600.0
          ...
51712    1500.0
51713     600.0
51714    2000.0
51715    2500.0
51716    1500.0
Name: cost, Length: 51667, dtype: float64

In [52]:
df['cost'].fillna(df['cost'].mean(), inplace=True)

In [53]:
df.cost.unique()

array([ 800.        ,  300.        ,  600.        ,  700.        ,
        550.        ,  500.        ,  450.        ,  650.        ,
        400.        ,  900.        ,  200.        ,  750.        ,
        150.        ,  850.        ,  100.        , 1200.        ,
        350.        ,  250.        ,  950.        , 1000.        ,
       1500.        , 1300.        ,  199.        ,   80.        ,
       1100.        ,  160.        , 1600.        ,  230.        ,
        130.        ,   50.        ,  190.        , 1700.        ,
        555.46403102, 1400.        ,  180.        , 1350.        ,
       2200.        , 2000.        , 1800.        , 1900.        ,
        330.        , 2500.        , 2100.        , 3000.        ,
       2800.        , 3400.        ,   40.        , 1250.        ,
       3500.        , 4000.        , 2400.        , 2600.        ,
        120.        , 1450.        ,  469.        ,   70.        ,
       3200.        ,   60.        ,  560.        ,  240.        ,
        360.        , 6000.        , 1050.        , 2300.        ,
       4100.        , 5000.        , 3700.        , 1650.        ,
       2700.        , 4500.        ,  140.        ])

In [54]:
# Change data type of online_order column: 
df['online_order']= df.online_order.apply(lambda x: True if x =='Yes' else False)

# Or 

df['book_table'].replace(('Yes', 'No'), (True, False), inplace=True)

df[['book_table', 'online_order']]

/var/folders/xw/_lnfz_x56cn_zn8_slshkwp80000gn/T/ipykernel_6515/987951190.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['book_table'].replace(('Yes', 'No'), (True, False), inplace=True)
/var/folders/xw/_lnfz_x56cn_zn8_slshkwp80000gn/T/ipykernel_6515/987951190.py:6: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['book_table'].replace(('Yes', 'No'), (True, False), inplace=True)

       book_table  online_order
0            True          True
1           False          True
2           False          True
3           False         False
4           False         False
...           ...           ...
51712       False         False
51713       False         False
51714       False         False
51715        True         False
51716       False         False

[51667 rows x 2 columns]

In [55]:
df.isnull().sum()

address           0
name              0
online_order      0
book_table        0
rate              0
votes             0
location         21
rest_type       227
cuisines         45
cost              0
reviews_list      0
type              0
city              0
dtype: int64

In [56]:
df.dropna(inplace=True) # will drop all the records where we have nulls in any columns.

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 51416 entries, 0 to 51716
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   address       51416 non-null  object
 1   name          51416 non-null  object
 2   online_order  51416 non-null  bool
 3   book_table    51416 non-null  bool
 4   rate          51416 non-null  float64
 5   votes         51416 non-null  int64
 6   location      51416 non-null  object
 7   rest_type     51416 non-null  object
 8   cuisines      51416 non-null  object
 9   cost          51416 non-null  float64
 10  reviews_list  51416 non-null  object
 11  type          51416 non-null  object
 12  city          51416 non-null  object
dtypes: bool(2), float64(2), int64(1), object(8)
memory usage: 4.8+ MB

### Data Visualization

In [58]:
# How many restaurants are offering online ordering?? 

df['online_order'].value_counts()

df['book_table'].value_counts()

book_table
False    44975
True      6441
Name: count, dtype: int64